[net]
batch=1
width=96
height=96
channels=3

[convolutional]
batch_normalize=1
filters=96
size=7
stride=2
pad=1
activation=relu

[maxpool]
size=3
stride=2
padding=0

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[maxpool]
size=3
stride=2
padding=0

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=relu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[route]
layers=-3,-1

[convolutional]
batch_normalize=0
filters=2
size=1
stride=1
pad=0
activation=linear

[avgpool]

[softmax]
